name: "rfcn_voc_air101"
layer {
  name: 'input-data'
  type: 'Python'
  top: 'data'
  top: 'im_info'
  top: 'gt_boxes'
  python_param {
    module: 'roi_data_layer.layer'
    layer: 'RoIDataLayer'
    param_str: "'num_classes': 21"
  }
}

################ air101 ################
layer {
  bottom: "data"
  top: "res1"
  name: "res1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    pad: 3
    stride: 2
    bias_term: false
  }
}
layer {
  bottom: "res1"
  top: "res1"
  name: "res1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res1"
  top: "res1"
  name: "res1_relu"
  type: "ReLU"
}
layer {
  bottom: "res1"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    kernel_size: 3
    stride: 2
    pool: MAX
    ceil_mode: false
    pad: 1
  }
}
layer {
  bottom: "pool1"
  top: "res2_match_conv"
  name: "res2_match_conv"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res2_match_conv"
  top: "res2_match_conv"
  name: "res2_match_conv_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "pool1"
  top: "res2_conv1_1"
  name: "res2_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res2_conv1_1"
  top: "res2_conv1_1"
  name: "res2_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res2_conv1_1"
  top: "res2_conv1_1"
  name: "res2_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res2_conv1_1"
  top: "res2_conv1_2"
  name: "res2_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}


layer {
  bottom: "pool1"
  top: "res2_conv2_1"
  name: "res2_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res2_conv2_1"
  top: "res2_conv2_1"
  name: "res2_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res2_conv2_1"
  top: "res2_conv2_1"
  name: "res2_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res2_conv2_1"
  top: "res2_conv2_2"
  name: "res2_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res2_conv2_2"
  top: "res2_conv2_2"
  name: "res2_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res2_conv2_2"
  top: "res2_conv2_2"
  name: "res2_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res2_conv2_2"
  top: "res2_conv2_3"
  name: "res2_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res2_conv1_2"
    bottom: "res2_conv2_3"
  top: "res2_cat"
  name: "res2_cat"
  type: "Concat"
}
layer {
  bottom: "res2_cat"
  top: "res2_cat"
  name: "res2_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res2_cat"
  top: "res2_cat"
  name: "res2_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res2_cat"
  top: "res2_conv3"
  name: "res2_conv3"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res2_conv3"
  top: "res2_conv3"
  name: "res2_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res2_match_conv"
  bottom: "res2_conv3"
  top: "res2"
  name: "res2"
  type: "Eltwise"
}
layer {
  bottom: "res2"
  top: "res2"
  name: "res2_relu"
  type: "ReLU"
}
####
layer {
  bottom: "res2"
  top: "res3_conv1_1"
  name: "res3_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res3_conv1_1"
  top: "res3_conv1_1"
  name: "res3_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res3_conv1_1"
  top: "res3_conv1_1"
  name: "res3_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res3_conv1_1"
  top: "res3_conv1_2"
  name: "res3_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res2"
  top: "res3_conv2_1"
  name: "res3_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res3_conv2_1"
  top: "res3_conv2_1"
  name: "res3_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res3_conv2_1"
  top: "res3_conv2_1"
  name: "res3_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res3_conv2_1"
  top: "res3_conv2_2"
  name: "res3_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res3_conv2_2"
  top: "res3_conv2_2"
  name: "res3_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res3_conv2_2"
  top: "res3_conv2_2"
  name: "res3_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res3_conv2_2"
  top: "res3_conv2_3"
  name: "res3_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res3_conv1_2"
    bottom: "res3_conv2_3"
  top: "res3_cat"
  name: "res3_cat"
  type: "Concat"
}
layer {
  bottom: "res3_cat"
  top: "res3_cat"
  name: "res3_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res3_cat"
  top: "res3_cat"
  name: "res3_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res3_cat"
  top: "res3_conv3"
  name: "res3_conv3"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res3_conv3"
  top: "res3_conv3"
  name: "res3_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res2"
  bottom: "res3_conv3"
  top: "res3"
  name: "res3"
  type: "Eltwise"
}
layer {
  bottom: "res3"
  top: "res3"
  name: "res3_relu"
  type: "ReLU"
}
####
layer {
  bottom: "res3"
  top: "res4_conv1_1"
  name: "res4_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res4_conv1_1"
  top: "res4_conv1_1"
  name: "res4_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res4_conv1_1"
  top: "res4_conv1_1"
  name: "res4_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res4_conv1_1"
  top: "res4_conv1_2"
  name: "res4_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res3"
  top: "res4_conv2_1"
  name: "res4_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res4_conv2_1"
  top: "res4_conv2_1"
  name: "res4_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res4_conv2_1"
  top: "res4_conv2_1"
  name: "res4_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res4_conv2_1"
  top: "res4_conv2_2"
  name: "res4_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res4_conv2_2"
  top: "res4_conv2_2"
  name: "res4_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res4_conv2_2"
  top: "res4_conv2_2"
  name: "res4_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res4_conv2_2"
  top: "res4_conv2_3"
  name: "res4_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res4_conv1_2"
    bottom: "res4_conv2_3"
  top: "res4_cat"
  name: "res4_cat"
  type: "Concat"
}
layer {
  bottom: "res4_cat"
  top: "res4_cat"
  name: "res4_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res4_cat"
  top: "res4_cat"
  name: "res4_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res4_cat"
  top: "res4_conv3"
  name: "res4_conv3"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}

layer {
  bottom: "res4_conv3"
  top: "res4_conv3"
  name: "res4_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res3"
  bottom: "res4_conv3"
  top: "res4"
  name: "res4"
  type: "Eltwise"
}
layer {
  bottom: "res4"
  top: "res4"
  name: "res4_relu"
  type: "ReLU"
}
####
layer {
  bottom: "res4"
  top: "res5_match_conv"
  name: "res5_match_conv"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 2
    bias_term: false
  }
}
layer {
  bottom: "res5_match_conv"
  top: "res5_match_conv"
  name: "res5_match_conv_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res4"
  top: "res5_conv1_1"
  name: "res5_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res5_conv1_1"
  top: "res5_conv1_1"
  name: "res5_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res5_conv1_1"
  top: "res5_conv1_1"
  name: "res5_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res5_conv1_1"
  top: "res5_conv1_2"
  name: "res5_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 2
    bias_term: false
  }
}
layer {
  bottom: "res4"
  top: "res5_conv2_1"
  name: "res5_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res5_conv2_1"
  top: "res5_conv2_1"
  name: "res5_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res5_conv2_1"
  top: "res5_conv2_1"
  name: "res5_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res5_conv2_1"
  top: "res5_conv2_2"
  name: "res5_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 2
    bias_term: false
  }
}
layer {
  bottom: "res5_conv2_2"
  top: "res5_conv2_2"
  name: "res5_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res5_conv2_2"
  top: "res5_conv2_2"
  name: "res5_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res5_conv2_2"
  top: "res5_conv2_3"
  name: "res5_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res5_conv1_2"
    bottom: "res5_conv2_3"
  top: "res5_cat"
  name: "res5_cat"
  type: "Concat"
}
layer {
  bottom: "res5_cat"
  top: "res5_cat"
  name: "res5_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res5_cat"
  top: "res5_cat"
  name: "res5_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res5_cat"
  top: "res5_conv3"
  name: "res5_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res5_conv3"
  top: "res5_conv3"
  name: "res5_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res5_match_conv"
  bottom: "res5_conv3"
  top: "res5"
  name: "res5"
  type: "Eltwise"
}
layer {
  bottom: "res5"
  top: "res5"
  name: "res5_relu"
  type: "ReLU"
}
####
layer {
  bottom: "res5"
  top: "res6_conv1_1"
  name: "res6_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res6_conv1_1"
  top: "res6_conv1_1"
  name: "res6_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res6_conv1_1"
  top: "res6_conv1_1"
  name: "res6_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res6_conv1_1"
  top: "res6_conv1_2"
  name: "res6_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res5"
  top: "res6_conv2_1"
  name: "res6_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res6_conv2_1"
  top: "res6_conv2_1"
  name: "res6_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res6_conv2_1"
  top: "res6_conv2_1"
  name: "res6_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res6_conv2_1"
  top: "res6_conv2_2"
  name: "res6_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res6_conv2_2"
  top: "res6_conv2_2"
  name: "res6_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res6_conv2_2"
  top: "res6_conv2_2"
  name: "res6_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res6_conv2_2"
  top: "res6_conv2_3"
  name: "res6_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res6_conv1_2"
    bottom: "res6_conv2_3"
  top: "res6_cat"
  name: "res6_cat"
  type: "Concat"
}
layer {
  bottom: "res6_cat"
  top: "res6_cat"
  name: "res6_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res6_cat"
  top: "res6_cat"
  name: "res6_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res6_cat"
  top: "res6_conv3"
  name: "res6_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res6_conv3"
  top: "res6_conv3"
  name: "res6_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res5"
  bottom: "res6_conv3"
  top: "res6"
  name: "res6"
  type: "Eltwise"
}
layer {
  bottom: "res6"
  top: "res6"
  name: "res6_relu"
  type: "ReLU"
}
layer {
  bottom: "res6"
  top: "res7_conv1_1"
  name: "res7_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res7_conv1_1"
  top: "res7_conv1_1"
  name: "res7_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res7_conv1_1"
  top: "res7_conv1_1"
  name: "res7_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res7_conv1_1"
  top: "res7_conv1_2"
  name: "res7_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res6"
  top: "res7_conv2_1"
  name: "res7_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res7_conv2_1"
  top: "res7_conv2_1"
  name: "res7_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res7_conv2_1"
  top: "res7_conv2_1"
  name: "res7_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res7_conv2_1"
  top: "res7_conv2_2"
  name: "res7_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res7_conv2_2"
  top: "res7_conv2_2"
  name: "res7_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res7_conv2_2"
  top: "res7_conv2_2"
  name: "res7_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res7_conv2_2"
  top: "res7_conv2_3"
  name: "res7_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res7_conv1_2"
    bottom: "res7_conv2_3"
  top: "res7_cat"
  name: "res7_cat"
  type: "Concat"
}
layer {
  bottom: "res7_cat"
  top: "res7_cat"
  name: "res7_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res7_cat"
  top: "res7_cat"
  name: "res7_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res7_cat"
  top: "res7_conv3"
  name: "res7_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res7_conv3"
  top: "res7_conv3"
  name: "res7_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res6"
  bottom: "res7_conv3"
  top: "res7"
  name: "res7"
  type: "Eltwise"
}
layer {
  bottom: "res7"
  top: "res7"
  name: "res7_relu"
  type: "ReLU"
}
layer {
  bottom: "res7"
  top: "res8_conv1_1"
  name: "res8_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res8_conv1_1"
  top: "res8_conv1_1"
  name: "res8_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res8_conv1_1"
  top: "res8_conv1_1"
  name: "res8_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res8_conv1_1"
  top: "res8_conv1_2"
  name: "res8_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res7"
  top: "res8_conv2_1"
  name: "res8_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res8_conv2_1"
  top: "res8_conv2_1"
  name: "res8_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res8_conv2_1"
  top: "res8_conv2_1"
  name: "res8_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res8_conv2_1"
  top: "res8_conv2_2"
  name: "res8_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res8_conv2_2"
  top: "res8_conv2_2"
  name: "res8_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res8_conv2_2"
  top: "res8_conv2_2"
  name: "res8_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res8_conv2_2"
  top: "res8_conv2_3"
  name: "res8_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res8_conv1_2"
    bottom: "res8_conv2_3"
  top: "res8_cat"
  name: "res8_cat"
  type: "Concat"
}
layer {
  bottom: "res8_cat"
  top: "res8_cat"
  name: "res8_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res8_cat"
  top: "res8_cat"
  name: "res8_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res8_cat"
  top: "res8_conv3"
  name: "res8_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res8_conv3"
  top: "res8_conv3"
  name: "res8_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res7"
  bottom: "res8_conv3"
  top: "res8"
  name: "res8"
  type: "Eltwise"
}
layer {
  bottom: "res8"
  top: "res8"
  name: "res8_relu"
  type: "ReLU"
}
####
layer {
  bottom: "res8"
  top: "res9_match_conv"
  name: "res9_match_conv"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 2
    bias_term: false
  }
}
layer {
  bottom: "res9_match_conv"
  top: "res9_match_conv"
  name: "res9_match_conv_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res8"
  top: "res9_conv1_1"
  name: "res9_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res9_conv1_1"
  top: "res9_conv1_1"
  name: "res9_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res9_conv1_1"
  top: "res9_conv1_1"
  name: "res9_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res9_conv1_1"
  top: "res9_conv1_2"
  name: "res9_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 2
    bias_term: false
  }
}
layer {
  bottom: "res8"
  top: "res9_conv2_1"
  name: "res9_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res9_conv2_1"
  top: "res9_conv2_1"
  name: "res9_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res9_conv2_1"
  top: "res9_conv2_1"
  name: "res9_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res9_conv2_1"
  top: "res9_conv2_2"
  name: "res9_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 2
    bias_term: false
  }
}
layer {
  bottom: "res9_conv2_2"
  top: "res9_conv2_2"
  name: "res9_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res9_conv2_2"
  top: "res9_conv2_2"
  name: "res9_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res9_conv2_2"
  top: "res9_conv2_3"
  name: "res9_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res9_conv1_2"
    bottom: "res9_conv2_3"
  top: "res9_cat"
  name: "res9_cat"
  type: "Concat"
}
layer {
  bottom: "res9_cat"
  top: "res9_cat"
  name: "res9_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res9_cat"
  top: "res9_cat"
  name: "res9_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res9_cat"
  top: "res9_conv3"
  name: "res9_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res9_conv3"
  top: "res9_conv3"
  name: "res9_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res9_match_conv"
  bottom: "res9_conv3"
  top: "res9"
  name: "res9"
  type: "Eltwise"
}
layer {
  bottom: "res9"
  top: "res9"
  name: "res9_relu"
  type: "ReLU"
}
####

layer {
  bottom: "res9"
  top: "res10_conv1_1"
  name: "res10_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res10_conv1_1"
  top: "res10_conv1_1"
  name: "res10_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res10_conv1_1"
  top: "res10_conv1_1"
  name: "res10_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res10_conv1_1"
  top: "res10_conv1_2"
  name: "res10_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res9"
  top: "res10_conv2_1"
  name: "res10_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res10_conv2_1"
  top: "res10_conv2_1"
  name: "res10_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res10_conv2_1"
  top: "res10_conv2_1"
  name: "res10_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res10_conv2_1"
  top: "res10_conv2_2"
  name: "res10_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res10_conv2_2"
  top: "res10_conv2_2"
  name: "res10_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res10_conv2_2"
  top: "res10_conv2_2"
  name: "res10_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res10_conv2_2"
  top: "res10_conv2_3"
  name: "res10_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res10_conv1_2"
    bottom: "res10_conv2_3"
  top: "res10_cat"
  name: "res10_cat"
  type: "Concat"
}
layer {
  bottom: "res10_cat"
  top: "res10_cat"
  name: "res10_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res10_cat"
  top: "res10_cat"
  name: "res10_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res10_cat"
  top: "res10_conv3"
  name: "res10_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res10_conv3"
  top: "res10_conv3"
  name: "res10_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res9"
  bottom: "res10_conv3"
  top: "res10"
  name: "res10"
  type: "Eltwise"
}
layer {
  bottom: "res10"
  top: "res10"
  name: "res10_relu"
  type: "ReLU"
}
####

layer {
  bottom: "res10"
  top: "res11_conv1_1"
  name: "res11_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res11_conv1_1"
  top: "res11_conv1_1"
  name: "res11_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res11_conv1_1"
  top: "res11_conv1_1"
  name: "res11_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res11_conv1_1"
  top: "res11_conv1_2"
  name: "res11_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res10"
  top: "res11_conv2_1"
  name: "res11_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res11_conv2_1"
  top: "res11_conv2_1"
  name: "res11_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res11_conv2_1"
  top: "res11_conv2_1"
  name: "res11_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res11_conv2_1"
  top: "res11_conv2_2"
  name: "res11_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res11_conv2_2"
  top: "res11_conv2_2"
  name: "res11_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res11_conv2_2"
  top: "res11_conv2_2"
  name: "res11_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res11_conv2_2"
  top: "res11_conv2_3"
  name: "res11_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res11_conv1_2"
    bottom: "res11_conv2_3"
  top: "res11_cat"
  name: "res11_cat"
  type: "Concat"
}
layer {
  bottom: "res11_cat"
  top: "res11_cat"
  name: "res11_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res11_cat"
  top: "res11_cat"
  name: "res11_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res11_cat"
  top: "res11_conv3"
  name: "res11_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res11_conv3"
  top: "res11_conv3"
  name: "res11_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res10"
  bottom: "res11_conv3"
  top: "res11"
  name: "res11"
  type: "Eltwise"
}
layer {
  bottom: "res11"
  top: "res11"
  name: "res11_relu"
  type: "ReLU"
}
####

layer {
  bottom: "res11"
  top: "res12_conv1_1"
  name: "res12_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res12_conv1_1"
  top: "res12_conv1_1"
  name: "res12_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res12_conv1_1"
  top: "res12_conv1_1"
  name: "res12_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res12_conv1_1"
  top: "res12_conv1_2"
  name: "res12_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res11"
  top: "res12_conv2_1"
  name: "res12_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res12_conv2_1"
  top: "res12_conv2_1"
  name: "res12_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res12_conv2_1"
  top: "res12_conv2_1"
  name: "res12_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res12_conv2_1"
  top: "res12_conv2_2"
  name: "res12_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res12_conv2_2"
  top: "res12_conv2_2"
  name: "res12_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res12_conv2_2"
  top: "res12_conv2_2"
  name: "res12_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res12_conv2_2"
  top: "res12_conv2_3"
  name: "res12_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res12_conv1_2"
    bottom: "res12_conv2_3"
  top: "res12_cat"
  name: "res12_cat"
  type: "Concat"
}
layer {
  bottom: "res12_cat"
  top: "res12_cat"
  name: "res12_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res12_cat"
  top: "res12_cat"
  name: "res12_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res12_cat"
  top: "res12_conv3"
  name: "res12_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res12_conv3"
  top: "res12_conv3"
  name: "res12_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res11"
  bottom: "res12_conv3"
  top: "res12"
  name: "res12"
  type: "Eltwise"
}
layer {
  bottom: "res12"
  top: "res12"
  name: "res12_relu"
  type: "ReLU"
}
####

layer {
  bottom: "res12"
  top: "res13_conv1_1"
  name: "res13_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res13_conv1_1"
  top: "res13_conv1_1"
  name: "res13_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res13_conv1_1"
  top: "res13_conv1_1"
  name: "res13_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res13_conv1_1"
  top: "res13_conv1_2"
  name: "res13_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res12"
  top: "res13_conv2_1"
  name: "res13_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res13_conv2_1"
  top: "res13_conv2_1"
  name: "res13_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res13_conv2_1"
  top: "res13_conv2_1"
  name: "res13_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res13_conv2_1"
  top: "res13_conv2_2"
  name: "res13_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res13_conv2_2"
  top: "res13_conv2_2"
  name: "res13_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res13_conv2_2"
  top: "res13_conv2_2"
  name: "res13_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res13_conv2_2"
  top: "res13_conv2_3"
  name: "res13_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res13_conv1_2"
    bottom: "res13_conv2_3"
  top: "res13_cat"
  name: "res13_cat"
  type: "Concat"
}
layer {
  bottom: "res13_cat"
  top: "res13_cat"
  name: "res13_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res13_cat"
  top: "res13_cat"
  name: "res13_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res13_cat"
  top: "res13_conv3"
  name: "res13_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res13_conv3"
  top: "res13_conv3"
  name: "res13_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res12"
  bottom: "res13_conv3"
  top: "res13"
  name: "res13"
  type: "Eltwise"
}
layer {
  bottom: "res13"
  top: "res13"
  name: "res13_relu"
  type: "ReLU"
}
####

layer {
  bottom: "res13"
  top: "res14_conv1_1"
  name: "res14_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res14_conv1_1"
  top: "res14_conv1_1"
  name: "res14_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res14_conv1_1"
  top: "res14_conv1_1"
  name: "res14_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res14_conv1_1"
  top: "res14_conv1_2"
  name: "res14_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res13"
  top: "res14_conv2_1"
  name: "res14_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res14_conv2_1"
  top: "res14_conv2_1"
  name: "res14_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res14_conv2_1"
  top: "res14_conv2_1"
  name: "res14_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res14_conv2_1"
  top: "res14_conv2_2"
  name: "res14_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res14_conv2_2"
  top: "res14_conv2_2"
  name: "res14_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res14_conv2_2"
  top: "res14_conv2_2"
  name: "res14_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res14_conv2_2"
  top: "res14_conv2_3"
  name: "res14_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res14_conv1_2"
    bottom: "res14_conv2_3"
  top: "res14_cat"
  name: "res14_cat"
  type: "Concat"
}
layer {
  bottom: "res14_cat"
  top: "res14_cat"
  name: "res14_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res14_cat"
  top: "res14_cat"
  name: "res14_cat_relu"
  type: "ReLU"
}

layer {
  bottom: "res14_cat"
  top: "res14_conv3"
  name: "res14_conv3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res14_conv3"
  top: "res14_conv3"
  name: "res14_conv3_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res13"
  bottom: "res14_conv3"
  top: "res14"
  name: "res14"
  type: "Eltwise"
}
layer {
  bottom: "res14"
  top: "res14"
  name: "res14_relu"
  type: "ReLU"
}
####

layer {
  bottom: "res14"
  top: "res15_conv1_1"
  name: "res15_conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res15_conv1_1"
  top: "res15_conv1_1"
  name: "res15_conv1_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res15_conv1_1"
  top: "res15_conv1_1"
  name: "res15_conv1_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res15_conv1_1"
  top: "res15_conv1_2"
  name: "res15_conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res14"
  top: "res15_conv2_1"
  name: "res15_conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res15_conv2_1"
  top: "res15_conv2_1"
  name: "res15_conv2_1_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res15_conv2_1"
  top: "res15_conv2_1"
  name: "res15_conv2_1_relu"
  type: "ReLU"
}
layer {
  bottom: "res15_conv2_1"
  top: "res15_conv2_2"
  name: "res15_conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res15_conv2_2"
  top: "res15_conv2_2"
  name: "res15_conv2_2_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  bottom: "res15_conv2_2"
  top: "res15_conv2_2"
  name: "res15_conv2_2_relu"
  type: "ReLU"
}
layer {
  bottom: "res15_conv2_2"
  top: "res15_conv2_3"
  name: "res15_conv2_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  bottom: "res15_conv1_2"
    bottom: "res15_conv2_3"
  top: "res15_cat"
  name: "res15_cat"
  type: "Concat"
}
layer {
  bottom: "res15_cat"
  top: "res15_cat"
  name: "res15_cat_scale"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
