name: "inception_resnet_v2"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 299
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_train_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 299
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "conv1_3x3_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_3x3_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1_3x3_s2_bn"
  type: "BatchNorm"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv1_3x3_s2_scale"
  type: "Scale"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_3x3_s2_relu"
  type: "ReLU"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
}
layer {
  name: "conv2_3x3_s1"
  type: "Convolution"
  bottom: "conv1_3x3_s2"
  top: "conv2_3x3_s1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2_3x3_s1_bn"
  type: "BatchNorm"
  bottom: "conv2_3x3_s1"
  top: "conv2_3x3_s1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_3x3_s1_scale"
  type: "Scale"
  bottom: "conv2_3x3_s1"
  top: "conv2_3x3_s1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_3x3_s1_relu"
  type: "ReLU"
  bottom: "conv2_3x3_s1"
  top: "conv2_3x3_s1"
}
layer {
  name: "conv3_3x3_s1"
  type: "Convolution"
  bottom: "conv2_3x3_s1"
  top: "conv3_3x3_s1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv3_3x3_s1_bn"
  type: "BatchNorm"
  bottom: "conv3_3x3_s1"
  top: "conv3_3x3_s1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_3x3_s1_scale"
  type: "Scale"
  bottom: "conv3_3x3_s1"
  top: "conv3_3x3_s1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_3x3_s1_relu"
  type: "ReLU"
  bottom: "conv3_3x3_s1"
  top: "conv3_3x3_s1"
}
layer {
  name: "inception_stem1_3x3_s2"
  type: "Convolution"
  bottom: "conv3_3x3_s1"
  top: "inception_stem1_3x3_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_stem1_3x3_s2_bn"
  type: "BatchNorm"
  bottom: "inception_stem1_3x3_s2"
  top: "inception_stem1_3x3_s2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_stem1_3x3_s2_scale"
  type: "Scale"
  bottom: "inception_stem1_3x3_s2"
  top: "inception_stem1_3x3_s2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_stem1_3x3_s2_relu"
  type: "ReLU"
  bottom: "inception_stem1_3x3_s2"
  top: "inception_stem1_3x3_s2"
}
layer {
  name: "inception_stem1_pool"
  type: "Pooling"
  bottom: "conv3_3x3_s1"
  top: "inception_stem1_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_stem1"
  type: "Concat"
  bottom: "inception_stem1_3x3_s2"
  bottom: "inception_stem1_pool"
  top: "inception_stem1"
}
layer {
  name: "inception_stem2_3x3_reduce"
  type: "Convolution"
  bottom: "inception_stem1"
  top: "inception_stem2_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_stem2_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_stem2_3x3_reduce"
  top: "inception_stem2_3x3_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_stem2_3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_stem2_3x3_reduce"
  top: "inception_stem2_3x3_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_stem2_3x3_reduce_relu"
  type: "ReLU"
  bottom: "inception_stem2_3x3_reduce"
  top: "inception_stem2_3x3_reduce"
}
layer {
  name: "inception_stem2_3x3"
  type: "Convolution"
  bottom: "inception_stem2_3x3_reduce"
  top: "inception_stem2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_stem2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_stem2_3x3"
  top: "inception_stem2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_stem2_3x3_scale"
  type: "Scale"
  bottom: "inception_stem2_3x3"
  top: "inception_stem2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_stem2_3x3_relu"
  type: "ReLU"
  bottom: "inception_stem2_3x3"
  top: "inception_stem2_3x3"
}
layer {
  name: "inception_stem2_7x1_reduce"
  type: "Convolution"
  bottom: "inception_stem1"
  top: "inception_stem2_7x1_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_stem2_7x1_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_stem2_7x1_reduce"
  top: "inception_stem2_7x1_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_stem2_7x1_reduce_scale"
  type: "Scale"
  bottom: "inception_stem2_7x1_reduce"
  top: "inception_stem2_7x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_stem2_7x1_reduce_relu"
  type: "ReLU"
  bottom: "inception_stem2_7x1_reduce"
  top: "inception_stem2_7x1_reduce"
}
layer {
  name: "inception_stem2_7x1"
  type: "Convolution"
  bottom: "inception_stem2_7x1_reduce"
  top: "inception_stem2_7x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
  }
}
layer {
  name: "inception_stem2_7x1_bn"
  type: "BatchNorm"
  bottom: "inception_stem2_7x1"
  top: "inception_stem2_7x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_stem2_7x1_scale"
  type: "Scale"
  bottom: "inception_stem2_7x1"
  top: "inception_stem2_7x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_stem2_7x1_relu"
  type: "ReLU"
  bottom: "inception_stem2_7x1"
  top: "inception_stem2_7x1"
}
layer {
  name: "inception_stem2_1x7"
  type: "Convolution"
  bottom: "inception_stem2_7x1"
  top: "inception_stem2_1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
  }
}
layer {
  name: "inception_stem2_1x7_bn"
  type: "BatchNorm"
  bottom: "inception_stem2_1x7"
  top: "inception_stem2_1x7"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_stem2_1x7_scale"
  type: "Scale"
  bottom: "inception_stem2_1x7"
  top: "inception_stem2_1x7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_stem2_1x7_relu"
  type: "ReLU"
  bottom: "inception_stem2_1x7"
  top: "inception_stem2_1x7"
}
layer {
  name: "inception_stem2_3x3_2"
  type: "Convolution"
  bottom: "inception_stem2_1x7"
  top: "inception_stem2_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_stem2_3x3_2_bn"
  type: "BatchNorm"
  bottom: "inception_stem2_3x3_2"
  top: "inception_stem2_3x3_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_stem2_3x3_2_scale"
  type: "Scale"
  bottom: "inception_stem2_3x3_2"
  top: "inception_stem2_3x3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_stem2_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_stem2_3x3_2"
  top: "inception_stem2_3x3_2"
}
layer {
  name: "inception_stem2"
  type: "Concat"
  bottom: "inception_stem2_3x3"
  bottom: "inception_stem2_3x3_2"
  top: "inception_stem2"
}
layer {
  name: "inception_stem3_3x3_s2"
  type: "Convolution"
  bottom: "inception_stem2"
  top: "inception_stem3_3x3_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_stem3_3x3_s2_bn"
  type: "BatchNorm"
  bottom: "inception_stem3_3x3_s2"
  top: "inception_stem3_3x3_s2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_stem3_3x3_s2_scale"
  type: "Scale"
  bottom: "inception_stem3_3x3_s2"
  top: "inception_stem3_3x3_s2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_stem3_3x3_s2_relu"
  type: "ReLU"
  bottom: "inception_stem3_3x3_s2"
  top: "inception_stem3_3x3_s2"
}
layer {
  name: "inception_stem3_pool"
  type: "Pooling"
  bottom: "inception_stem2"
  top: "inception_stem3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_stem3"
  type: "Concat"
  bottom: "inception_stem3_3x3_s2"
  bottom: "inception_stem3_pool"
  top: "inception_stem3"
}
layer {
  name: "inception_resnet_v2_a1_1x1"
  type: "Convolution"
  bottom: "inception_stem3"
  top: "inception_resnet_v2_a1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a1_1x1"
  top: "inception_resnet_v2_a1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a1_1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a1_1x1"
  top: "inception_resnet_v2_a1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a1_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a1_1x1"
  top: "inception_resnet_v2_a1_1x1"
}
layer {
  name: "inception_resnet_v2_a1_3x3_reduce"
  type: "Convolution"
  bottom: "inception_stem3"
  top: "inception_resnet_v2_a1_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a1_3x3_reduce"
  top: "inception_resnet_v2_a1_3x3_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a1_3x3_reduce"
  top: "inception_resnet_v2_a1_3x3_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a1_3x3_reduce"
  top: "inception_resnet_v2_a1_3x3_reduce"
}
layer {
  name: "inception_resnet_v2_a1_3x3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a1_3x3_reduce"
  top: "inception_resnet_v2_a1_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a1_3x3"
  top: "inception_resnet_v2_a1_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a1_3x3"
  top: "inception_resnet_v2_a1_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a1_3x3"
  top: "inception_resnet_v2_a1_3x3"
}
layer {
  name: "inception_resnet_v2_a1_3x3_2_reduce"
  type: "Convolution"
  bottom: "inception_stem3"
  top: "inception_resnet_v2_a1_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a1_3x3_2_reduce"
  top: "inception_resnet_v2_a1_3x3_2_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a1_3x3_2_reduce"
  top: "inception_resnet_v2_a1_3x3_2_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a1_3x3_2_reduce"
  top: "inception_resnet_v2_a1_3x3_2_reduce"
}
layer {
  name: "inception_resnet_v2_a1_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a1_3x3_2_reduce"
  top: "inception_resnet_v2_a1_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a1_3x3_2"
  top: "inception_resnet_v2_a1_3x3_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a1_3x3_2"
  top: "inception_resnet_v2_a1_3x3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a1_3x3_2"
  top: "inception_resnet_v2_a1_3x3_2"
}
layer {
  name: "inception_resnet_v2_a1_3x3_3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a1_3x3_2"
  top: "inception_resnet_v2_a1_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a1_3x3_3"
  top: "inception_resnet_v2_a1_3x3_3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a1_3x3_3"
  top: "inception_resnet_v2_a1_3x3_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a1_3x3_3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a1_3x3_3"
  top: "inception_resnet_v2_a1_3x3_3"
}
layer {
  name: "inception_resnet_v2_a1_concat"
  type: "Concat"
  bottom: "inception_resnet_v2_a1_1x1"
  bottom: "inception_resnet_v2_a1_3x3"
  bottom: "inception_resnet_v2_a1_3x3_3"
  top: "inception_resnet_v2_a1_concat"
}
layer {
  name: "inception_resnet_v2_a1_1x1_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a1_concat"
  top: "inception_resnet_v2_a1_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a1_1x1_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a1_1x1_2"
  top: "inception_resnet_v2_a1_1x1_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a1_1x1_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a1_1x1_2"
  top: "inception_resnet_v2_a1_1x1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a1_residual_eltwise"
  type: "Eltwise"
  bottom: "inception_stem3"
  bottom: "inception_resnet_v2_a1_1x1_2"
  top: "inception_resnet_v2_a1_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "inception_resnet_v2_a2_1x1"
  type: "Convolution"
  bottom: "inception_resnet_v2_a1_residual_eltwise"
  top: "inception_resnet_v2_a2_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a2_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a2_1x1"
  top: "inception_resnet_v2_a2_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a2_1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a2_1x1"
  top: "inception_resnet_v2_a2_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a2_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a2_1x1"
  top: "inception_resnet_v2_a2_1x1"
}
layer {
  name: "inception_resnet_v2_a2_3x3_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a1_residual_eltwise"
  top: "inception_resnet_v2_a2_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a2_3x3_reduce"
  top: "inception_resnet_v2_a2_3x3_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a2_3x3_reduce"
  top: "inception_resnet_v2_a2_3x3_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a2_3x3_reduce"
  top: "inception_resnet_v2_a2_3x3_reduce"
}
layer {
  name: "inception_resnet_v2_a2_3x3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a2_3x3_reduce"
  top: "inception_resnet_v2_a2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a2_3x3"
  top: "inception_resnet_v2_a2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a2_3x3"
  top: "inception_resnet_v2_a2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a2_3x3"
  top: "inception_resnet_v2_a2_3x3"
}
layer {
  name: "inception_resnet_v2_a2_3x3_2_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a1_residual_eltwise"
  top: "inception_resnet_v2_a2_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a2_3x3_2_reduce"
  top: "inception_resnet_v2_a2_3x3_2_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a2_3x3_2_reduce"
  top: "inception_resnet_v2_a2_3x3_2_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a2_3x3_2_reduce"
  top: "inception_resnet_v2_a2_3x3_2_reduce"
}
layer {
  name: "inception_resnet_v2_a2_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a2_3x3_2_reduce"
  top: "inception_resnet_v2_a2_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a2_3x3_2"
  top: "inception_resnet_v2_a2_3x3_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a2_3x3_2"
  top: "inception_resnet_v2_a2_3x3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a2_3x3_2"
  top: "inception_resnet_v2_a2_3x3_2"
}
layer {
  name: "inception_resnet_v2_a2_3x3_3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a2_3x3_2"
  top: "inception_resnet_v2_a2_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a2_3x3_3"
  top: "inception_resnet_v2_a2_3x3_3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a2_3x3_3"
  top: "inception_resnet_v2_a2_3x3_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a2_3x3_3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a2_3x3_3"
  top: "inception_resnet_v2_a2_3x3_3"
}
layer {
  name: "inception_resnet_v2_a2_concat"
  type: "Concat"
  bottom: "inception_resnet_v2_a2_1x1"
  bottom: "inception_resnet_v2_a2_3x3"
  bottom: "inception_resnet_v2_a2_3x3_3"
  top: "inception_resnet_v2_a2_concat"
}
layer {
  name: "inception_resnet_v2_a2_1x1_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a2_concat"
  top: "inception_resnet_v2_a2_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a2_1x1_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a2_1x1_2"
  top: "inception_resnet_v2_a2_1x1_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a2_1x1_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a2_1x1_2"
  top: "inception_resnet_v2_a2_1x1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a2_residual_eltwise"
  type: "Eltwise"
  bottom: "inception_resnet_v2_a1_residual_eltwise"
  bottom: "inception_resnet_v2_a2_1x1_2"
  top: "inception_resnet_v2_a2_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "inception_resnet_v2_a3_1x1"
  type: "Convolution"
  bottom: "inception_resnet_v2_a2_residual_eltwise"
  top: "inception_resnet_v2_a3_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a3_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a3_1x1"
  top: "inception_resnet_v2_a3_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a3_1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a3_1x1"
  top: "inception_resnet_v2_a3_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a3_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a3_1x1"
  top: "inception_resnet_v2_a3_1x1"
}
layer {
  name: "inception_resnet_v2_a3_3x3_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a2_residual_eltwise"
  top: "inception_resnet_v2_a3_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a3_3x3_reduce"
  top: "inception_resnet_v2_a3_3x3_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a3_3x3_reduce"
  top: "inception_resnet_v2_a3_3x3_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a3_3x3_reduce"
  top: "inception_resnet_v2_a3_3x3_reduce"
}
layer {
  name: "inception_resnet_v2_a3_3x3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a3_3x3_reduce"
  top: "inception_resnet_v2_a3_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a3_3x3"
  top: "inception_resnet_v2_a3_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a3_3x3"
  top: "inception_resnet_v2_a3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a3_3x3"
  top: "inception_resnet_v2_a3_3x3"
}
layer {
  name: "inception_resnet_v2_a3_3x3_2_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a2_residual_eltwise"
  top: "inception_resnet_v2_a3_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a3_3x3_2_reduce"
  top: "inception_resnet_v2_a3_3x3_2_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a3_3x3_2_reduce"
  top: "inception_resnet_v2_a3_3x3_2_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a3_3x3_2_reduce"
  top: "inception_resnet_v2_a3_3x3_2_reduce"
}
layer {
  name: "inception_resnet_v2_a3_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a3_3x3_2_reduce"
  top: "inception_resnet_v2_a3_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a3_3x3_2"
  top: "inception_resnet_v2_a3_3x3_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a3_3x3_2"
  top: "inception_resnet_v2_a3_3x3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a3_3x3_2"
  top: "inception_resnet_v2_a3_3x3_2"
}
layer {
  name: "inception_resnet_v2_a3_3x3_3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a3_3x3_2"
  top: "inception_resnet_v2_a3_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a3_3x3_3"
  top: "inception_resnet_v2_a3_3x3_3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a3_3x3_3"
  top: "inception_resnet_v2_a3_3x3_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a3_3x3_3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a3_3x3_3"
  top: "inception_resnet_v2_a3_3x3_3"
}
layer {
  name: "inception_resnet_v2_a3_concat"
  type: "Concat"
  bottom: "inception_resnet_v2_a3_1x1"
  bottom: "inception_resnet_v2_a3_3x3"
  bottom: "inception_resnet_v2_a3_3x3_3"
  top: "inception_resnet_v2_a3_concat"
}
layer {
  name: "inception_resnet_v2_a3_1x1_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a3_concat"
  top: "inception_resnet_v2_a3_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a3_1x1_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a3_1x1_2"
  top: "inception_resnet_v2_a3_1x1_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a3_1x1_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a3_1x1_2"
  top: "inception_resnet_v2_a3_1x1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a3_residual_eltwise"
  type: "Eltwise"
  bottom: "inception_resnet_v2_a2_residual_eltwise"
  bottom: "inception_resnet_v2_a3_1x1_2"
  top: "inception_resnet_v2_a3_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "inception_resnet_v2_a4_1x1"
  type: "Convolution"
  bottom: "inception_resnet_v2_a3_residual_eltwise"
  top: "inception_resnet_v2_a4_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a4_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a4_1x1"
  top: "inception_resnet_v2_a4_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a4_1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a4_1x1"
  top: "inception_resnet_v2_a4_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a4_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a4_1x1"
  top: "inception_resnet_v2_a4_1x1"
}
layer {
  name: "inception_resnet_v2_a4_3x3_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a3_residual_eltwise"
  top: "inception_resnet_v2_a4_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a4_3x3_reduce"
  top: "inception_resnet_v2_a4_3x3_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a4_3x3_reduce"
  top: "inception_resnet_v2_a4_3x3_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a4_3x3_reduce"
  top: "inception_resnet_v2_a4_3x3_reduce"
}
layer {
  name: "inception_resnet_v2_a4_3x3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a4_3x3_reduce"
  top: "inception_resnet_v2_a4_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a4_3x3"
  top: "inception_resnet_v2_a4_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a4_3x3"
  top: "inception_resnet_v2_a4_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a4_3x3"
  top: "inception_resnet_v2_a4_3x3"
}
layer {
  name: "inception_resnet_v2_a4_3x3_2_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a3_residual_eltwise"
  top: "inception_resnet_v2_a4_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a4_3x3_2_reduce"
  top: "inception_resnet_v2_a4_3x3_2_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a4_3x3_2_reduce"
  top: "inception_resnet_v2_a4_3x3_2_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a4_3x3_2_reduce"
  top: "inception_resnet_v2_a4_3x3_2_reduce"
}
layer {
  name: "inception_resnet_v2_a4_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a4_3x3_2_reduce"
  top: "inception_resnet_v2_a4_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a4_3x3_2"
  top: "inception_resnet_v2_a4_3x3_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a4_3x3_2"
  top: "inception_resnet_v2_a4_3x3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a4_3x3_2"
  top: "inception_resnet_v2_a4_3x3_2"
}
layer {
  name: "inception_resnet_v2_a4_3x3_3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a4_3x3_2"
  top: "inception_resnet_v2_a4_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a4_3x3_3"
  top: "inception_resnet_v2_a4_3x3_3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a4_3x3_3"
  top: "inception_resnet_v2_a4_3x3_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a4_3x3_3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a4_3x3_3"
  top: "inception_resnet_v2_a4_3x3_3"
}
layer {
  name: "inception_resnet_v2_a4_concat"
  type: "Concat"
  bottom: "inception_resnet_v2_a4_1x1"
  bottom: "inception_resnet_v2_a4_3x3"
  bottom: "inception_resnet_v2_a4_3x3_3"
  top: "inception_resnet_v2_a4_concat"
}
layer {
  name: "inception_resnet_v2_a4_1x1_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a4_concat"
  top: "inception_resnet_v2_a4_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a4_1x1_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a4_1x1_2"
  top: "inception_resnet_v2_a4_1x1_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a4_1x1_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a4_1x1_2"
  top: "inception_resnet_v2_a4_1x1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a4_residual_eltwise"
  type: "Eltwise"
  bottom: "inception_resnet_v2_a3_residual_eltwise"
  bottom: "inception_resnet_v2_a4_1x1_2"
  top: "inception_resnet_v2_a4_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "inception_resnet_v2_a5_1x1"
  type: "Convolution"
  bottom: "inception_resnet_v2_a4_residual_eltwise"
  top: "inception_resnet_v2_a5_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a5_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a5_1x1"
  top: "inception_resnet_v2_a5_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a5_1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a5_1x1"
  top: "inception_resnet_v2_a5_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a5_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a5_1x1"
  top: "inception_resnet_v2_a5_1x1"
}
layer {
  name: "inception_resnet_v2_a5_3x3_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a4_residual_eltwise"
  top: "inception_resnet_v2_a5_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a5_3x3_reduce"
  top: "inception_resnet_v2_a5_3x3_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a5_3x3_reduce"
  top: "inception_resnet_v2_a5_3x3_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a5_3x3_reduce"
  top: "inception_resnet_v2_a5_3x3_reduce"
}
layer {
  name: "inception_resnet_v2_a5_3x3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a5_3x3_reduce"
  top: "inception_resnet_v2_a5_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a5_3x3"
  top: "inception_resnet_v2_a5_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a5_3x3"
  top: "inception_resnet_v2_a5_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a5_3x3"
  top: "inception_resnet_v2_a5_3x3"
}
layer {
  name: "inception_resnet_v2_a5_3x3_2_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a4_residual_eltwise"
  top: "inception_resnet_v2_a5_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a5_3x3_2_reduce"
  top: "inception_resnet_v2_a5_3x3_2_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a5_3x3_2_reduce"
  top: "inception_resnet_v2_a5_3x3_2_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a5_3x3_2_reduce"
  top: "inception_resnet_v2_a5_3x3_2_reduce"
}
layer {
  name: "inception_resnet_v2_a5_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a5_3x3_2_reduce"
  top: "inception_resnet_v2_a5_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a5_3x3_2"
  top: "inception_resnet_v2_a5_3x3_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a5_3x3_2"
  top: "inception_resnet_v2_a5_3x3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a5_3x3_2"
  top: "inception_resnet_v2_a5_3x3_2"
}
layer {
  name: "inception_resnet_v2_a5_3x3_3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a5_3x3_2"
  top: "inception_resnet_v2_a5_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a5_3x3_3"
  top: "inception_resnet_v2_a5_3x3_3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_3_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a5_3x3_3"
  top: "inception_resnet_v2_a5_3x3_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a5_3x3_3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v2_a5_3x3_3"
  top: "inception_resnet_v2_a5_3x3_3"
}
layer {
  name: "inception_resnet_v2_a5_concat"
  type: "Concat"
  bottom: "inception_resnet_v2_a5_1x1"
  bottom: "inception_resnet_v2_a5_3x3"
  bottom: "inception_resnet_v2_a5_3x3_3"
  top: "inception_resnet_v2_a5_concat"
}
layer {
  name: "inception_resnet_v2_a5_1x1_2"
  type: "Convolution"
  bottom: "inception_resnet_v2_a5_concat"
  top: "inception_resnet_v2_a5_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_resnet_v2_a5_1x1_2_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v2_a5_1x1_2"
  top: "inception_resnet_v2_a5_1x1_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "inception_resnet_v2_a5_1x1_2_scale"
  type: "Scale"
  bottom: "inception_resnet_v2_a5_1x1_2"
  top: "inception_resnet_v2_a5_1x1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v2_a5_residual_eltwise"
  type: "Eltwise"
  bottom: "inception_resnet_v2_a4_residual_eltwise"
  bottom: "inception_resnet_v2_a5_1x1_2"
  top: "inception_resnet_v2_a5_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "reduction_a_pool"
  type: "Pooling"
  bottom: "inception_resnet_v2_a5_residual_eltwise"
  top: "reduction_a_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "reduction_a_3x3"
  type: "Convolution"
  bottom: "inception_resnet_v2_a5_residual_eltwise"
  top: "reduction_a_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "reduction_a_3x3_bn"
  type: "BatchNorm"
  bottom: "reduction_a_3x3"
  top: "reduction_a_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "reduction_a_3x3_scale"
  type: "Scale"
  bottom: "reduction_a_3x3"
  top: "reduction_a_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "reduction_a_3x3_relu"
  type: "ReLU"
  bottom: "reduction_a_3x3"
  top: "reduction_a_3x3"
}
layer {
  name: "reduction_a_3x3_2_reduce"
  type: "Convolution"
  bottom: "inception_resnet_v2_a5_residual_eltwise"
  top: "reduction_a_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
